depot/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-11-27 13:07:57.047531"], ["updated_at", "2023-11-27 13:07:57.047531"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["product_id", 3], ["cart_id", 7], ["created_at", "2023-11-27 17:17:58.055040"], ["updated_at", "2023-11-27 17:17:58.055040"], ["quantity", 1]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2023-11-27 17:18:50.847274"], ["quantity", 2], ["id", 3]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
    # @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save