depot/app/controllers/concerns/current_cart.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-11-27 13:07:57.047531"], ["updated_at", "2023-11-27 13:07:57.047531"]]
---
        def set_cart
            @cart = Cart.find(session[:cart_id])
        rescue ActiveRecord::RecordNotFound
            @cart = Cart.create